Results/Verifications/S2427/bottleneck-determination/update_index/threads-4/sysbench.log
$ time sysbench --config-file=sysbench.conf --threads=4 oltp_update_index --tables=32 --table-size=1000000 --db-ps-mode=auto --rand-typ
e=uniform run
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 994.14 qps: 994.14 (r/w/o: 0.00/971.25/22.89) lat (ms,95%): 6.21 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 868.55 qps: 868.55 (r/w/o: 0.00/846.24/22.30) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 970.19 qps: 970.19 (r/w/o: 0.00/946.79/23.40) lat (ms,95%): 7.04 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 1079.17 qps: 1079.17 (r/w/o: 0.00/1052.07/27.10) lat (ms,95%): 5.28 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 1087.29 qps: 1087.29 (r/w/o: 0.00/1061.59/25.70) lat (ms,95%): 5.18 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 1149.20 qps: 1149.20 (r/w/o: 0.00/1121.60/27.60) lat (ms,95%): 4.91 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 4 tps: 1185.00 qps: 1185.00 (r/w/o: 0.00/1157.20/27.80) lat (ms,95%): 4.82 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 4 tps: 1185.17 qps: 1185.17 (r/w/o: 0.00/1155.26/29.90) lat (ms,95%): 4.82 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 4 tps: 1194.23 qps: 1194.23 (r/w/o: 0.00/1166.14/28.10) lat (ms,95%): 4.74 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 4 tps: 1176.38 qps: 1176.38 (r/w/o: 0.00/1145.78/30.60) lat (ms,95%): 4.82 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           106248
        other:                           2654
        total:                           108902
    transactions:                        108902 (1088.91 per sec.)
    queries:                             108902 (1088.91 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.0056s
    total number of events:              108902

Latency (ms):
         min:                                    1.23
         avg:                                    3.67
         max:                                  118.86
         95th percentile:                        5.67
         sum:                               399771.30

Threads fairness:
    events (avg/stddev):           27225.5000/18.58
    execution time (avg/stddev):   99.9428/0.00


real    1m40.104s
user    0m2.063s
sys     0m5.859s